notes/org/azure/azure.org
#+TITLE: Random Notes
#+SETUPFILE: ../../setup.org

* Managed Service Identities

  No need to have credentials or service principal.

  Docs - Part of the Active Directory docs
  https://docs.microsoft.com/en-us/azure/active-directory/managed-identities-azure-resources/

* Resource Providers

  That is, "cloud services".

  For example, there is a resource provider that provides virtual machines. It's
  called Microsoft.Compute.

  Every resource provider exposes a set of actions. That is, the service has an
  API.

* RBAC

  Fine-grained control to the Azure "control plane".

  When you assign a role to a certain scope, resources within that scope inherit
  the role assignment.

  A *Role* is a collection of actions (i.e. a collection of API operations). A
  *Role Assignment* gives a _security principal_ the ability to perform that set
  of _actions_ on that _scope_.

  There are 3 top level roles in Azure:

  1. Owner
  2. Contributor
  3. Reader

** Security Principal

   - User
   - Group
   - Service Principal

** Role

   - Built-in
   - Custom

** Scope

   - Subscription
   - Resource Group
   - Resource

* Subscription Model

  Scope heirarchy:
  Tenant -> Management Group -> Subscription -> Resource Group -> Resource

** Tenant

   Azure Active Directory entity that encompasses a whole organization. A tenant
   has at least one subscription and user. You use it to manage subscriptions
   and users in the organization.

   This is kind of like an AWS Organization that is used to manage all the AWS
   accounts in a company.

** User

   An individual and is associated with only one tenant, the organization that
   they belong to. May have access to multiple subscriptions.

   A user is a "User" in the Active Directory. That means users are tenant-level
   entities. Each user can have multiple subscriptions.

** Subscription

   The agreements with Microsoft to use cloud services, including Azure.

   Sometimes a "subscription" is referred to as an "account" i.e. "az account
   set" command. I think a subscription is the most similar thing to an AWS
   account.

   The fact that Azure has resource groups adds a layer of isolation within
   subscriptions that's harder to attain in AWS accounts, so in Azure you are
   likely to have less subscriptions that you'd have accounts in AWS.

** Account

   Can mean a few things:

   1. The Microsoft Account that was used when signing up for Azure. A Microsoft
      Account is the account you use to access Office 365, XBox Live, etc.

     - When you sign up for an Azure subscription with a personal Microsoft
       Account, an Azure AD Tenant is created for you.

     - Or, you can create an Azure subscription associated with an existing
       Azure AD Tenant.

   2. An Azure subscription. This is what `azure account list` and `azure account
      set` do

   3. A Service Principal, which is sometimes referred to as using a "service
      account". "Service principals are accounts not tied to any particular user" -
      https://docs.microsoft.com/en-us/cli/azure/authenticate-azure-cli?view=azure-cli-latest#sign-in-with-a-service-principal

** Management Group

   A level of management above subscriptions (but still within a single
   tenant). Management Groups allow you to associate certain settings with many
   subscriptions.

** Storage Account

   How is this different from account or resource group?

** Role

   Controls access to resources. Can be assigned to users, groups, or services.

** Resource

   Associated with a subscription

** Application

   Something in Azure that outsources authentication to Azure AD. AD uses Oauth
   2.0 to authenticate to the application, which mean the application must have
   a URL.

   Sometimes "Application" refers to the entity requesting an auth token in an
   Oauth2 authentication flow. I think OAuth2 refers to this entity as the
   "client application". See:
   https://docs.microsoft.com/en-us/azure/active-directory/develop/developer-glossary#client-application

   Sometimes "Application" refers to a VM. For example when adding an access
   policy to keyvault; if you add a VM, it is labelled as an "application". In
   this case I suppose "application" refers to "code on the VM that needs
   keyvault creds".

* IMDS

  Available to all vms created with ARM.

  Get Token
  #+BEGIN_SRC sh
    curl -H Metadata:true \
         "http://169.254.169.254/metadata/identity/oauth2/token?resource=https://management.azure.com&api-version=2018-04-02"
  #+END_SRC

* VM

