_site/notes/azure/azure.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Random Notes</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/static/main.css" />
</head>
<body>
<div id="preamble" class="status">
<nav id="navbar" class="cf">
  <ul class="cf">
    <li class="fl">
      <a href="/">cfclrk</a>
    </li>
    <li class="fr">
      <a href="/articles/home.html">Articles</a>
    </li>
    <li class="fr">
      <a href="/notes/home.html">Notes</a>
    </li>
	<li class="fr">
      <a href="/cloudformation/home.html">CloudFormation</a>
    </li>
  </ul>
</nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Random Notes</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org7660c86">Managed Service Identities</a></li>
<li><a href="#org294b42c">Resource Providers</a></li>
<li><a href="#org5c02ab1">RBAC</a>
<ul>
<li><a href="#org22d60a5">Security Principal</a></li>
<li><a href="#orgcae5846">Role</a></li>
<li><a href="#org9a98946">Scope</a></li>
</ul>
</li>
<li><a href="#orgbf8de88">Subscription Model</a>
<ul>
<li><a href="#orga770ec5">Tenant</a></li>
<li><a href="#org361b2ba">User</a></li>
<li><a href="#orgb65d4c5">Subscription</a></li>
<li><a href="#orgba543d4">Account</a></li>
<li><a href="#orgce5c748">Management Group</a></li>
<li><a href="#org3abc8fc">Storage Account</a></li>
<li><a href="#org19b78a2">Role</a></li>
<li><a href="#org4a8c7ad">Resource</a></li>
<li><a href="#org4e8eeb5">Application</a></li>
</ul>
</li>
<li><a href="#org5fecc08">IMDS</a></li>
<li><a href="#org25bc30c">VM</a>
<ul>
<li><a href="#orgc39455d">List VM offers in region</a></li>
</ul>
</li>
<li><a href="#orgc6a1f02">VM Extensions</a></li>
<li><a href="#orgff188f8">API</a></li>
<li><a href="#org092cadf">All Locations</a>
<ul>
<li><a href="#org0372bbf">List</a></li>
<li><a href="#orga31281c">Loop</a></li>
</ul>
</li>
<li><a href="#orgbaaa6c0">Load Balancers</a>
<ul>
<li><a href="#orgfb60556">Create LB Rule</a></li>
<li><a href="#org2635b8d">Create Load Balancer</a></li>
</ul>
</li>
<li><a href="#org7e0cdbb">Providers</a>
<ul>
<li><a href="#org558e968">All provides and registration state</a></li>
<li><a href="#org3cc3c4b">Registerd namespaces</a></li>
</ul>
</li>
<li><a href="#orga3f00f8">Subscription Quotas</a></li>
<li><a href="#org4febacf">Create Public Static Ip</a></li>
<li><a href="#orgb66729d">ACR</a>
<ul>
<li><a href="#orgf06657a">List registries</a></li>
<li><a href="#org1630dff">List repositories</a></li>
<li><a href="#org5c8b5b8">List repository versions</a></li>
</ul>
</li>
<li><a href="#org4f712a1">Api Versions</a>
<ul>
<li><a href="#orgc63eef1">Python</a></li>
</ul>
</li>
<li><a href="#org577feb3">Users</a>
<ul>
<li><a href="#orgb21e700">Get My User</a></li>
</ul>
</li>
</ul>
</div>
</nav>

<div id="outline-container-org7660c86" class="outline-2">
<h2 id="org7660c86"><a href="#org7660c86">Managed Service Identities</a></h2>
<div class="outline-text-2" id="text-org7660c86">
<p>
No need to have credentials or service principal.
</p>

<p>
Docs - Part of the Active Directory docs
<a href="https://docs.microsoft.com/en-us/azure/active-directory/managed-identities-azure-resources/">https://docs.microsoft.com/en-us/azure/active-directory/managed-identities-azure-resources/</a>
</p>
</div>
</div>

<div id="outline-container-org294b42c" class="outline-2">
<h2 id="org294b42c"><a href="#org294b42c">Resource Providers</a></h2>
<div class="outline-text-2" id="text-org294b42c">
<p>
That is, "cloud services".
</p>

<p>
For example, there is a resource provider that provides virtual machines. It's
called Microsoft.Compute.
</p>

<p>
Every resource provider exposes a set of actions. That is, the service has an
API.
</p>
</div>
</div>

<div id="outline-container-org5c02ab1" class="outline-2">
<h2 id="org5c02ab1"><a href="#org5c02ab1">RBAC</a></h2>
<div class="outline-text-2" id="text-org5c02ab1">
<p>
Fine-grained control to the Azure "control plane".
</p>

<p>
When you assign a role to a certain scope, resources within that scope inherit
the role assignment.
</p>

<p>
A <b>Role</b> is a collection of actions (i.e. a collection of API operations). A
<b>Role Assignment</b> gives a <span class="underline">security principal</span> the ability to perform that set
of <span class="underline">actions</span> on that <span class="underline">scope</span>.
</p>

<p>
There are 3 top level roles in Azure:
</p>

<ol class="org-ol">
<li>Owner</li>
<li>Contributor</li>
<li>Reader</li>
</ol>
</div>

<div id="outline-container-org22d60a5" class="outline-3">
<h3 id="org22d60a5"><a href="#org22d60a5">Security Principal</a></h3>
<div class="outline-text-3" id="text-org22d60a5">
<ul class="org-ul">
<li>User</li>
<li>Group</li>
<li>Service Principal</li>
</ul>
</div>
</div>

<div id="outline-container-orgcae5846" class="outline-3">
<h3 id="orgcae5846"><a href="#orgcae5846">Role</a></h3>
<div class="outline-text-3" id="text-orgcae5846">
<ul class="org-ul">
<li>Built-in</li>
<li>Custom</li>
</ul>
</div>
</div>

<div id="outline-container-org9a98946" class="outline-3">
<h3 id="org9a98946"><a href="#org9a98946">Scope</a></h3>
<div class="outline-text-3" id="text-org9a98946">
<ul class="org-ul">
<li>Subscription</li>
<li>Resource Group</li>
<li>Resource</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgbf8de88" class="outline-2">
<h2 id="orgbf8de88"><a href="#orgbf8de88">Subscription Model</a></h2>
<div class="outline-text-2" id="text-orgbf8de88">
<p>
Scope heirarchy:
Tenant -&gt; Management Group -&gt; Subscription -&gt; Resource Group -&gt; Resource
</p>
</div>

<div id="outline-container-orga770ec5" class="outline-3">
<h3 id="orga770ec5"><a href="#orga770ec5">Tenant</a></h3>
<div class="outline-text-3" id="text-orga770ec5">
<p>
Azure Active Directory entity that encompasses a whole organization. A tenant
has at least one subscription and user. You use it to manage subscriptions
and users in the organization.
</p>

<p>
This is kind of like an AWS Organization that is used to manage all the AWS
accounts in a company.
</p>
</div>
</div>

<div id="outline-container-org361b2ba" class="outline-3">
<h3 id="org361b2ba"><a href="#org361b2ba">User</a></h3>
<div class="outline-text-3" id="text-org361b2ba">
<p>
An individual and is associated with only one tenant, the organization that
they belong to. May have access to multiple subscriptions.
</p>

<p>
A user is a "User" in the Active Directory. That means users are tenant-level
entities. Each user can have multiple subscriptions.
</p>
</div>
</div>

<div id="outline-container-orgb65d4c5" class="outline-3">
<h3 id="orgb65d4c5"><a href="#orgb65d4c5">Subscription</a></h3>
<div class="outline-text-3" id="text-orgb65d4c5">
<p>
The agreements with Microsoft to use cloud services, including Azure.
</p>

<p>
Sometimes a "subscription" is referred to as an "account" i.e. "az account
set" command. I think a subscription is the most similar thing to an AWS
account.
</p>

<p>
The fact that Azure has resource groups adds a layer of isolation within
subscriptions that's harder to attain in AWS accounts, so in Azure you are
likely to have less subscriptions that you'd have accounts in AWS.
</p>
</div>
</div>

<div id="outline-container-orgba543d4" class="outline-3">
<h3 id="orgba543d4"><a href="#orgba543d4">Account</a></h3>
<div class="outline-text-3" id="text-orgba543d4">
<p>
Can mean a few things:
</p>

<ol class="org-ol">
<li>The Microsoft Account that was used when signing up for Azure. A Microsoft
Account is the account you use to access Office 365, XBox Live, etc.

<ul class="org-ul">
<li>When you sign up for an Azure subscription with a personal Microsoft
Account, an Azure AD Tenant is created for you.</li>

<li>Or, you can create an Azure subscription associated with an existing
Azure AD Tenant.</li>
</ul></li>

<li>An Azure subscription. This is what `azure account list` and `azure account
set` do</li>

<li>A Service Principal, which is sometimes referred to as using a "service
account". "Service principals are accounts not tied to any particular user" -
<a href="https://docs.microsoft.com/en-us/cli/azure/authenticate-azure-cli?view=azure-cli-latest#sign-in-with-a-service-principal">https://docs.microsoft.com/en-us/cli/azure/authenticate-azure-cli?view=azure-cli-latest#sign-in-with-a-service-principal</a></li>
</ol>
</div>
</div>

<div id="outline-container-orgce5c748" class="outline-3">
<h3 id="orgce5c748"><a href="#orgce5c748">Management Group</a></h3>
<div class="outline-text-3" id="text-orgce5c748">
<p>
A level of management above subscriptions (but still within a single
tenant). Management Groups allow you to associate certain settings with many
subscriptions.
</p>
</div>
</div>

<div id="outline-container-org3abc8fc" class="outline-3">
<h3 id="org3abc8fc"><a href="#org3abc8fc">Storage Account</a></h3>
<div class="outline-text-3" id="text-org3abc8fc">
<p>
How is this different from account or resource group?
</p>
</div>
</div>

<div id="outline-container-org19b78a2" class="outline-3">
<h3 id="org19b78a2"><a href="#org19b78a2">Role</a></h3>
<div class="outline-text-3" id="text-org19b78a2">
<p>
Controls access to resources. Can be assigned to users, groups, or services.
</p>
</div>
</div>

<div id="outline-container-org4a8c7ad" class="outline-3">
<h3 id="org4a8c7ad"><a href="#org4a8c7ad">Resource</a></h3>
<div class="outline-text-3" id="text-org4a8c7ad">
<p>
Associated with a subscription
</p>
</div>
</div>

<div id="outline-container-org4e8eeb5" class="outline-3">
<h3 id="org4e8eeb5"><a href="#org4e8eeb5">Application</a></h3>
<div class="outline-text-3" id="text-org4e8eeb5">
<p>
Something in Azure that outsources authentication to Azure AD. AD uses Oauth
2.0 to authenticate to the application, which mean the application must have
a URL.
</p>

<p>
Sometimes "Application" refers to the entity requesting an auth token in an
Oauth2 authentication flow. I think OAuth2 refers to this entity as the
"client application". See:
<a href="https://docs.microsoft.com/en-us/azure/active-directory/develop/developer-glossary#client-application">https://docs.microsoft.com/en-us/azure/active-directory/develop/developer-glossary#client-application</a>
</p>

<p>
Sometimes "Application" refers to a VM. For example when adding an access
policy to keyvault; if you add a VM, it is labelled as an "application". In
this case I suppose "application" refers to "code on the VM that needs
keyvault creds".
</p>
</div>
</div>
</div>

<div id="outline-container-org5fecc08" class="outline-2">
<h2 id="org5fecc08"><a href="#org5fecc08">IMDS</a></h2>
<div class="outline-text-2" id="text-org5fecc08">
<p>
Available to all vms created with ARM.
</p>

<p>
Get Token
</p>
<div class="org-src-container">
<pre class="src src-sh">curl -H Metadata:true <span style="color: #98be65;">\</span>
     <span style="color: #98be65;">"http://169.254.169.254/metadata/identity/oauth2/token?resource=https://management.azure.com&amp;api-version=2018-04-02"</span>
</pre>
</div>
</div>
</div>
