notes/org/azure/azure.org
** List VM offers in region

   #+begin_src sh
     az vm image list --all -l eastus
   #+end_src

* VM Extensions

  VM Extensions are run using a vm agent. The agent is installed by default in
  Azure Marketplace images.

* API

  List vms

  #+begin_src sh
    r=$(curl -H Metadata:true "http://169.254.169.254/metadata/identity/oauth2/token?resource=https://management.azure.com&api-version=2018-04-02")
    access_token=$(echo $r | jq -r '.access_token')
    url="https://management.azure.com/subscriptions/10f9b671-4896-4336-ba3d-82e9d4ab0b52/providers/Microsoft.Compute/virtualMachines?api-version=2018-06-01"
    curl $url -H "Authorization: Bearer $access_token" | jq
  #+end_src

* All Locations

** List

   #+begin_src sh
     az account list-locations --query "[].name"
   #+end_src

** Loop

   Create a Public IP in each location

   #+begin_src sh
     locations=($(az account list-locations | jq -r '.[].name'))
     for i in "${!locations[@]}"; do
         location=${locations[$i]}
         echo ip-$i $$location
         az network public-ip create \
            -g PublicIpPool \
            -n ip-$i \
            --allocation-method Static
     done
   #+end_src

* Load Balancers

** Create LB Rule

   #+begin_src sh
     az network lb rule create -g $CLUSTER_NAME \
        --lb-name fixed-ip-lb \
        -n fixed-ip-ssh-rule \
        --protocol Tcp \
        --frontend-port 443 \
        --backend-pool-name fixed-ip-lbbepool \
        --backend-port 443
   #+end_src

** Create Load Balancer

   #+begin_src sh
     az network lb create \
        -n mylb \
        -g $ResourceGroup \
        -l westus2 \
        --public-ip-address "/subscriptions/$SUBSCRIPTION_ID/resourceGroups/PublicIpPool/providers/Microsoft.Network/publicIPAddresses/$IP_NAME"
   #+end_src

* Providers

** All provides and registration state

   az provider list --query "[].{Provider:namespace, Status:registrationState}"
   --out table

** Registerd namespaces

   az provider list --query "[?registrationState == 'Registered'].namespace"
   --out table

* Subscription Quotas

  #+begin_src fish
    function getLimit --description "Get a quota limit in the given region"
        set location $argv[1]
        set limit (az vm list-usage \
            --location $location \
            -o json \
            | jq -r '.[] | select(.localName == "Total Regional vCPUs") | .limit')
        echo "$location: $limit"
    end

    function getAllLimits --description "Get all Total Region vCPU limits"
        set locations (az account list-locations | jq -r '.[].name')
        echo $locations | xargs -n 1 -P (count $locations) -I {} fish -c 'getLimit {}'
    end
  #+end_src

  #+begin_src sh
    allLocations=$(az account list-locations | jq -r '.[].name')

    echo $allLocations | xargs
    for location in ; do
        limit=$(az vm list-usage \
                   --location $location \
                   -o json \
                    | jq -r '.[] | select(.localName == "Total Regional vCPUs") | .limit')
        echo "$location: $limit"
    done
  #+end_src

* Create Public Static Ip

  #+begin_src sh
    location="westus2"
    az network public-ip create \
       -g PublicIpPool \
       -n ip-$location-1 \
       -l $location \
       --allocation-method Static
  #+end_src

* ACR

** List registries

   #+begin_src sh :results output
     az acr list | jq -c '.[] | {name, loginServer, location}'
   #+end_src

** List repositories

   #+begin_src sh :var name=""
     az acr repository list -n $name
   #+end_src

** List repository versions

   #+begin_src sh :var name=""
     az acr repository show-manifests \
        -n $name \
        --repository quay.io/kubernetes-ingress-controller/nginx-ingress-controller
   #+end_src

