_site/notes/azure/azure.html

<div id="outline-container-org25bc30c" class="outline-2">
<h2 id="org25bc30c"><a href="#org25bc30c">VM</a></h2>
<div class="outline-text-2" id="text-org25bc30c">
</div>
<div id="outline-container-orgc39455d" class="outline-3">
<h3 id="orgc39455d"><a href="#orgc39455d">List VM offers in region</a></h3>
<div class="outline-text-3" id="text-orgc39455d">
<div class="org-src-container">
<pre class="src src-sh">az vm image list --all -l eastus
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc6a1f02" class="outline-2">
<h2 id="orgc6a1f02"><a href="#orgc6a1f02">VM Extensions</a></h2>
<div class="outline-text-2" id="text-orgc6a1f02">
<p>
VM Extensions are run using a vm agent. The agent is installed by default in
Azure Marketplace images.
</p>
</div>
</div>

<div id="outline-container-orgff188f8" class="outline-2">
<h2 id="orgff188f8"><a href="#orgff188f8">API</a></h2>
<div class="outline-text-2" id="text-orgff188f8">
<p>
List vms
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #dcaeea;">r</span>=$(curl -H Metadata:true <span style="color: #98be65;">"http://169.254.169.254/metadata/identity/oauth2/token?resource=https://management.azure.com&amp;api-version=2018-04-02"</span>)
<span style="color: #dcaeea;">access_token</span>=$(<span style="color: #c678dd;">echo</span> $<span style="color: #dcaeea;">r</span> | jq -r <span style="color: #98be65;">'.access_token'</span>)
<span style="color: #dcaeea;">url</span>=<span style="color: #98be65;">"https://management.azure.com/subscriptions/10f9b671-4896-4336-ba3d-82e9d4ab0b52/providers/Microsoft.Compute/virtualMachines?api-version=2018-06-01"</span>
curl $<span style="color: #dcaeea;">url</span> -H <span style="color: #98be65;">"Authorization: Bearer $access_token"</span> | jq
</pre>
</div>
</div>
</div>

<div id="outline-container-org092cadf" class="outline-2">
<h2 id="org092cadf"><a href="#org092cadf">All Locations</a></h2>
<div class="outline-text-2" id="text-org092cadf">
</div>
<div id="outline-container-org0372bbf" class="outline-3">
<h3 id="org0372bbf"><a href="#org0372bbf">List</a></h3>
<div class="outline-text-3" id="text-org0372bbf">
<div class="org-src-container">
<pre class="src src-sh">az account list-locations --query <span style="color: #98be65;">"[].name"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orga31281c" class="outline-3">
<h3 id="orga31281c"><a href="#orga31281c">Loop</a></h3>
<div class="outline-text-3" id="text-orga31281c">
<p>
Create a Public IP in each location
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #dcaeea;">locations</span>=($(az account list-locations | jq -r <span style="color: #98be65;">'.[].name'</span>))
<span style="color: #51afef;">for</span> i<span style="color: #51afef;"> in</span> <span style="color: #98be65;">"${!locations[@]}"</span>; <span style="color: #51afef;">do</span>
    <span style="color: #dcaeea;">location</span>=${<span style="color: #dcaeea;">locations</span>[$<span style="color: #dcaeea;">i</span>]}
    <span style="color: #c678dd;">echo</span> ip-$<span style="color: #dcaeea;">i</span> $<span style="color: #dcaeea;">$location</span>
    az network public-ip create <span style="color: #98be65;">\</span>
       -g PublicIpPool <span style="color: #98be65;">\</span>
       -n ip-$<span style="color: #dcaeea;">i</span> <span style="color: #98be65;">\</span>
       --allocation-method Static
<span style="color: #51afef;">done</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgbaaa6c0" class="outline-2">
<h2 id="orgbaaa6c0"><a href="#orgbaaa6c0">Load Balancers</a></h2>
<div class="outline-text-2" id="text-orgbaaa6c0">
</div>
<div id="outline-container-orgfb60556" class="outline-3">
<h3 id="orgfb60556"><a href="#orgfb60556">Create LB Rule</a></h3>
<div class="outline-text-3" id="text-orgfb60556">
<div class="org-src-container">
<pre class="src src-sh">az network lb rule create -g $<span style="color: #dcaeea;">CLUSTER_NAME</span> <span style="color: #98be65;">\</span>
   --lb-name fixed-ip-lb <span style="color: #98be65;">\</span>
   -n fixed-ip-ssh-rule <span style="color: #98be65;">\</span>
   --protocol Tcp <span style="color: #98be65;">\</span>
   --frontend-port 443 <span style="color: #98be65;">\</span>
   --backend-pool-name fixed-ip-lbbepool <span style="color: #98be65;">\</span>
   --backend-port 443
</pre>
</div>
</div>
</div>

<div id="outline-container-org2635b8d" class="outline-3">
<h3 id="org2635b8d"><a href="#org2635b8d">Create Load Balancer</a></h3>
<div class="outline-text-3" id="text-org2635b8d">
<div class="org-src-container">
<pre class="src src-sh">az network lb create <span style="color: #98be65;">\</span>
   -n mylb <span style="color: #98be65;">\</span>
   -g $<span style="color: #dcaeea;">ResourceGroup</span> <span style="color: #98be65;">\</span>
   -l westus2 <span style="color: #98be65;">\</span>
   --public-ip-address <span style="color: #98be65;">"/subscriptions/$SUBSCRIPTION_ID/resourceGroups/PublicIpPool/providers/Microsoft.Network/publicIPAddresses/$IP_NAME"</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org7e0cdbb" class="outline-2">
<h2 id="org7e0cdbb"><a href="#org7e0cdbb">Providers</a></h2>
<div class="outline-text-2" id="text-org7e0cdbb">
</div>
<div id="outline-container-org558e968" class="outline-3">
<h3 id="org558e968"><a href="#org558e968">All provides and registration state</a></h3>
<div class="outline-text-3" id="text-org558e968">
<p>
az provider list &#x2013;query "[].{Provider:namespace, Status:registrationState}"
&#x2013;out table
</p>
</div>
</div>

<div id="outline-container-org3cc3c4b" class="outline-3">
<h3 id="org3cc3c4b"><a href="#org3cc3c4b">Registerd namespaces</a></h3>
<div class="outline-text-3" id="text-org3cc3c4b">
<p>
az provider list &#x2013;query "[?registrationState == 'Registered'].namespace"
&#x2013;out table
</p>
</div>
</div>
</div>

<div id="outline-container-orga3f00f8" class="outline-2">
<h2 id="orga3f00f8"><a href="#orga3f00f8">Subscription Quotas</a></h2>
<div class="outline-text-2" id="text-orga3f00f8">
<div class="org-src-container">
<pre class="src src-fish"><span style="color: #51afef;">function</span> <span style="color: #c678dd;">getLimit</span> <span style="color: #51afef; font-weight: bold;">--description</span> <span style="color: #98be65;">"Get a quota limit in the given region"</span>
    <span style="color: #51afef;">set</span> <span style="color: #dcaeea;">location</span> <span style="color: #98be65;">$</span><span style="color: #dcaeea;">argv</span>[<span style="color: #a9a1e1;">1</span>]
    <span style="color: #51afef;">set</span> <span style="color: #dcaeea;">limit</span> (az vm list-usage <span style="color: #51afef; font-weight: bold;">\</span>
        <span style="color: #c678dd;">--location</span> <span style="color: #98be65;">$</span><span style="color: #dcaeea;">location</span> <span style="color: #51afef; font-weight: bold;">\</span>
        <span style="color: #c678dd;">-o</span> json <span style="color: #51afef; font-weight: bold;">\</span>
        <span style="color: #51afef; font-weight: bold;">|</span> jq -r <span style="color: #98be65;">'.[] | select(.localName == "Total Regional vCPUs") | .limit'</span>)
    <span style="color: #c678dd;">echo</span> <span style="color: #98be65;">"$location: $limit"</span>
<span style="color: #51afef;">end</span>

<span style="color: #51afef;">function</span> <span style="color: #c678dd;">getAllLimits</span> <span style="color: #51afef; font-weight: bold;">--description</span> <span style="color: #98be65;">"Get all Total Region vCPU limits"</span>
    <span style="color: #51afef;">set</span> <span style="color: #dcaeea;">locations</span> (<span style="color: #c678dd;">az</span> account list-locations <span style="color: #51afef; font-weight: bold;">|</span> <span style="color: #c678dd;">jq</span> -r <span style="color: #98be65;">'.[].name'</span>)
    <span style="color: #c678dd;">echo</span> <span style="color: #98be65;">$</span><span style="color: #dcaeea;">locations</span> <span style="color: #51afef; font-weight: bold;">|</span> <span style="color: #c678dd;">xargs</span> -n <span style="color: #a9a1e1;">1</span> -P (<span style="color: #c678dd;">count</span> <span style="color: #98be65;">$</span><span style="color: #dcaeea;">locations</span>) -I {} <span style="color: #c678dd;">fish</span> -c <span style="color: #98be65;">'getLimit {}'</span>
<span style="color: #51afef;">end</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #dcaeea;">allLocations</span>=$(az account list-locations | jq -r <span style="color: #98be65;">'.[].name'</span>)

<span style="color: #c678dd;">echo</span> $<span style="color: #dcaeea;">allLocations</span> | xargs
<span style="color: #51afef;">for</span> location<span style="color: #51afef;"> in</span> ; <span style="color: #51afef;">do</span>
    <span style="color: #dcaeea;">limit</span>=$(az vm list-usage <span style="color: #98be65;">\</span>
               --location $<span style="color: #dcaeea;">location</span> <span style="color: #98be65;">\</span>
               -o json <span style="color: #98be65;">\</span>
                | jq -r <span style="color: #98be65;">'.[] | select(.localName == "Total Regional vCPUs") | .limit'</span>)
    <span style="color: #c678dd;">echo</span> <span style="color: #98be65;">"$location: $limit"</span>
<span style="color: #51afef;">done</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org4febacf" class="outline-2">
<h2 id="org4febacf"><a href="#org4febacf">Create Public Static Ip</a></h2>
<div class="outline-text-2" id="text-org4febacf">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #dcaeea;">location</span>=<span style="color: #98be65;">"westus2"</span>
az network public-ip create <span style="color: #98be65;">\</span>
   -g PublicIpPool <span style="color: #98be65;">\</span>
   -n ip-$<span style="color: #dcaeea;">location</span>-1 <span style="color: #98be65;">\</span>
   -l $<span style="color: #dcaeea;">location</span> <span style="color: #98be65;">\</span>
   --allocation-method Static
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb66729d" class="outline-2">
<h2 id="orgb66729d"><a href="#orgb66729d">ACR</a></h2>
<div class="outline-text-2" id="text-orgb66729d">
</div>
<div id="outline-container-orgf06657a" class="outline-3">
<h3 id="orgf06657a"><a href="#orgf06657a">List registries</a></h3>
<div class="outline-text-3" id="text-orgf06657a">
<div class="org-src-container">
<pre class="src src-sh">az acr list | jq -c <span style="color: #98be65;">'.[] | {name, loginServer, location}'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org1630dff" class="outline-3">
<h3 id="org1630dff"><a href="#org1630dff">List repositories</a></h3>
<div class="outline-text-3" id="text-org1630dff">
<div class="org-src-container">
<pre class="src src-sh">az acr repository list -n $<span style="color: #dcaeea;">name</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org5c8b5b8" class="outline-3">
<h3 id="org5c8b5b8"><a href="#org5c8b5b8">List repository versions</a></h3>
<div class="outline-text-3" id="text-org5c8b5b8">
<div class="org-src-container">
<pre class="src src-sh">az acr repository show-manifests <span style="color: #98be65;">\</span>
   -n $<span style="color: #dcaeea;">name</span> <span style="color: #98be65;">\</span>
   --repository quay.io/kubernetes-ingress-controller/nginx-ingress-controller
</pre>
</div>
</div>
</div>
</div>
