notes/org/azure/azure.org
* Api Versions

  Get the latest Api Version for something

  #+begin_src sh
    az provider list --query "[?namespace=='Microsoft.ClassicNetwork']" > ~/cats/resource_provider.json
    jq '.[].resourceTypes[] | select(.resourceType == "reservedIps").apiVersions | first' <~/cats/resource_provider.json
  #+end_src

** Python

   #+begin_src python
     from msrestazure.tools import parse_resource_id

     def _get_ip_address(self, resource_id: str) -> str:
         # Determine the latest API version for this resource type
         parsed_id = parse_resource_id(resource_id)
         provider = self.resource_client.providers.get(parsed_id["namespace"])
         resource_type_def = next(
             i
             for i in provider.resource_types
             if i.resource_type.lower() == parsed_id["resource_type"].lower()
         )

         # Supported API versions are ordered from newest to oldest
         api_version = resource_type_def.api_versions[0]

         # Fetch the IP resource and return its IP address
         resource = self.resource_client.resources.get_by_id(resource_id, api_version)
         return resource.properties["ipAddress"]
   #+end_src

* Users

** Get My User

   #+begin_src sh
     az ad user list --query "[?mailNickname=='chris.clark']"
   #+end_src
