_site/notes/azure/azure.html

<div id="outline-container-org4f712a1" class="outline-2">
<h2 id="org4f712a1"><a href="#org4f712a1">Api Versions</a></h2>
<div class="outline-text-2" id="text-org4f712a1">
<p>
Get the latest Api Version for something
</p>

<div class="org-src-container">
<pre class="src src-sh">az provider list --query <span style="color: #98be65;">"[?namespace=='Microsoft.ClassicNetwork']"</span> &gt; ~/cats/resource_provider.json
jq <span style="color: #98be65;">'.[].resourceTypes[] | select(.resourceType == "reservedIps").apiVersions | first'</span> &lt;~/cats/resource_provider.json
</pre>
</div>
</div>

<div id="outline-container-orgc63eef1" class="outline-3">
<h3 id="orgc63eef1"><a href="#orgc63eef1">Python</a></h3>
<div class="outline-text-3" id="text-orgc63eef1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #51afef;">from</span> msrestazure.tools <span style="color: #51afef;">import</span> parse_resource_id

<span style="color: #51afef;">def</span> <span style="color: #c678dd;">_get_ip_address</span>(<span style="color: #51afef;">self</span>, resource_id: <span style="color: #c678dd;">str</span>) -&gt; <span style="color: #c678dd;">str</span>:
    <span style="color: #5B6268;"># </span><span style="color: #5B6268;">Determine the latest API version for this resource type</span>
    parsed_id = parse_resource_id(resource_id)
    <span style="color: #dcaeea;">provider</span> = <span style="color: #51afef;">self</span>.resource_client.providers.get(parsed_id[<span style="color: #98be65;">"namespace"</span>])
    <span style="color: #dcaeea;">resource_type_def</span> = <span style="color: #c678dd;">next</span>(
        i
        <span style="color: #51afef;">for</span> i <span style="color: #51afef;">in</span> provider.resource_types
        <span style="color: #51afef;">if</span> i.resource_type.lower() == parsed_id[<span style="color: #98be65;">"resource_type"</span>].lower()
    )

    <span style="color: #5B6268;"># </span><span style="color: #5B6268;">Supported API versions are ordered from newest to oldest</span>
    <span style="color: #dcaeea;">api_version</span> = resource_type_def.api_versions[0]

    <span style="color: #5B6268;"># </span><span style="color: #5B6268;">Fetch the IP resource and return its IP address</span>
    <span style="color: #dcaeea;">resource</span> = <span style="color: #51afef;">self</span>.resource_client.resources.get_by_id(resource_id, api_version)
    <span style="color: #51afef;">return</span> resource.properties[<span style="color: #98be65;">"ipAddress"</span>]
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org577feb3" class="outline-2">
<h2 id="org577feb3"><a href="#org577feb3">Users</a></h2>
<div class="outline-text-2" id="text-org577feb3">
</div>
<div id="outline-container-orgb21e700" class="outline-3">
<h3 id="orgb21e700"><a href="#orgb21e700">Get My User</a></h3>
<div class="outline-text-3" id="text-orgb21e700">
<div class="org-src-container">
<pre class="src src-sh">az ad user list --query <span style="color: #98be65;">"[?mailNickname=='chris.clark']"</span>
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
